{
  "name": "Email Quarantined Messages",
  "queryLanguage": "KQL",
  "source": "DefenderAH",
  "timeRange": "P7D",
  "kql": "EmailEvents | where Timestamp >= ago(7d) | where coalesce(LatestDeliveryLocation, DeliveryLocation) == \"Quarantine\" | project Timestamp, RecipientEmailAddress, SenderFromAddress, Subject,LatestDeliveryAction,ThreatTypes | order by Timestamp desc"
}